[
    {
        "title": "Certains messages de votre courrielleur du bureau ne sont pas accessibles depuis le portail web à la maison ? Il existe une solution.",
        "description": "Si vous constatez que les anciens messages de votre boîte de réception ou les messages envoyés ne sont pas visibles depuis le portail web, c'est probablement lié à la configuration de votre courrielleur. Contactez votre support informatique local afin qu'il modifie la configuration de votre courrielleur pour passer du protocole POP (Post Office Protocol) à IMAP (Internet Message Access Protocol). Ce changement permettra une synchronisation pleinement fonctionnelle entre votre courrielleur et le portail web.",
        "date": "26 août 2020"
    },
    {
        "title": "Suite à la réorganisation ministérielle de cet été, comment modifier votre signature ?",
        "description": "Suite à la réorganisation ministérielle, vous avez peut-être besoin de mettre a jour votre signature depuis le Courrielleur ou le portail web. Pour cela vous pouvez utiliser les boutons ci-dessous pour consulter la documentation ainsi que modifier directement votre signature dans le portail web.",
        "date": "18 août 2020",
        "buttons": [
            {
                "name": "Comment modifier ma signature dans le Courrielleur",
                "class": "help",
                "href": "http://bureautique.metier.e2.rie.gouv.fr/supports/messagerie/courrielleur/#605signature",
                "tooltip": "Cliquez-ici pour voir la documentation sur la modification de votre signature dans le Courrielleur"
            },
            {
                "name": "Comment modifier ma signature dans le portail web",
                "class": "help",
                "href": "/aide/doc/melweb/index.html#53-Identites",
                "tooltip": "Cliquez-ici pour voir la documentation sur la modification de votre signature dans le portail web"
            },
            {
                "name": "Modifier ma signature dans le portail web",
                "class": "action",
                "href": "/?_task=settings&_action=identities",
                "tooltip": "Cliquez-ici et sélectionnez votre boite pour accéder directement à la modification de votre signature dans le portail web"
            }
        ]
    },
    {
        "title": "Nouveau : Vous pouvez désormais archiver vos messages directement depuis le portail web",
        "description": "Votre boîte de messagerie dépasse son quota et vous n'êtes pas au bureau pour archiver ? Avant de demander une augmentation du quota de votre boite, vous pouvez archiver des messages de la boîte depuis le portail web. Pour cela, vous pouvez soit consulter la documentation, soit directement commencer à archiver, grâce aux boutons accessibles ci-dessous.",
        "date": "23 avril 2020",
        "buttons": [
            {
                "name": "Ouvrir la documentation",
                "class": "help",
                "href": "/aide/doc/archivage/",
                "tooltip": "Cliquez-ici pour voir la documentation sur l'archivage des messages depuis le portail web"
            },
            {
                "name": "Commencer à archiver",
                "class": "action",
                "href": "/?_task=mail&_mbox=INBOX&_help_action=archivage",
                "tooltip": "Cliquez-ici pour accéder à vos messages et commencer à archiver en cliquant sur le bouton d'archivage depuis le portail web"
            }
        ]
    }
]